#+title: 23. Clone MT19937
#+setupfile: ./setup.org

#+begin_src python :results output
print(f'b = {bin(0x9d2c5680)}')
print(f'c = {bin(0xefc60000)}')
#+end_src

#+RESULTS:
: b = 0b10011101001011000101011010000000
: c = 0b11101111110001100000000000000000

Undoing ~y = y ^ ((y << self.t) & self.c)~:
#+begin_src text
AAAAAAAAAAAAAAAEEBBBBBBBBBBBBBBB
^
(
111011111100011
&
EEBBBBBBBBBBBBB
)
EEB0BBBBBB000BB
================================
KKKKKKKKKKKKKKKEEBBBBBBBBBBBBBBB
^
(
EEBBBBBBBBBBBBB
&
111011111100011
)
================================
AAAAAAAAAAAAAAAEEBBBBBBBBBBBBBBB
#+end_src

Undoing ~y = y ^ ((y << self.s) & self.b)~:
#+begin_src text
AAAAAAABBBBBBBBBBBBBBBBBBKKKKKKK
^
(
1001110100101100010101101
&
BBBBBBBBBBBBBBBBBBKKKKKKK
)
================================
CCCCCCCCCCCCCCCCCCEEEEEEEKKKKKKK

UNDO:

CCCCCCCCCCCCCCCCCCEEEEEEEKKKKKKK
^
(
0000000000000000000101101
&
CCCCCCCCCCCEEEEEEEKKKKKKK
)
================================
CCCCCCCCCCCCCCCCCCBBBBBBBKKKKKKK
^
(
0000000000001100010101101
&
CCCCCCCCCCCBBBBBBBKKKKKKK
)
================================
CCCCCCCCCCCBBBBBBBBBBBBBBKKKKKKK
^
(
0000110100101100010101101
&
CCCCBBBBBBBBBBBBBBKKKKKKK
)
================================
CCCCAAABBBBBBBBBBBBBBBBBBKKKKKKK
^
(
1001110100101100010101101
&
BBBBBBBBBBBBBBBBBBKKKKKKK
)
================================
AAAAAAABBBBBBBBBBBBBBBBBBKKKKKKK
#+end_src

Undoing ~y = y ^ (y >> self.u)~:
#+begin_src text

AAAAAAAAAAAAAAAAAAAAABBBBBBBBBBB
^
           AAAAAAAAAAAAAAAAAAAAA
================================
AAAAAAAAAAACCCCCCCCCCCCCCCCCCCCC

UNDO:

AAAAAAAAAAACCCCCCCCCCCCCCCCCCCCC
^
           AAAAAAAAAAACCCCCCCCCC
================================
AAAAAAAAAAAAAAAAAAAAABCCCCCCCCCC
^
           AAAAAAAAAAAAAAAAAAAAA
================================
AAAAAAAAAAAAAAAAAAAAABBBBBBBBBBB
#+end_src
